test/solver/incompressibleVoF/cases/vofRow4IsoAdvectorMoving/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Starts at rest: the mesh motion and gravity are what drive the flow,
// and a zero initial flux keeps the start-up flux projection of
// initCorrectPhi.H a no-op, as it is in the moving tutorials.
internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
